ErpTest/src/InformationRegisters/пкДополнительныеНастройкиPekkaniska/пкДополнительныеНастройкиPekkaniska.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>пкДополнительныеНастройкиPekkaniska</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.пкДополнительныеНастройки</types>
    </type>
  </resources>
  <dimensions>
    <name>Настройка</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.пкДополнительныеНастройки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ErpTest/src/InformationRegisters/пкДополнительныеНастройкиPekkaniska/Forms/ФормаСписка/Module.bsl
&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьСервер();
КонецПроцедуры

&НаСервере
Процедура СохранитьСервер ()
	СохранитьСтрокиРекурсивно(ДеревоНастроек);	
КонецПроцедуры	

&НаСервере
Процедура СохранитьСтрокиРекурсивно (СтрокаФормы)
	Для Каждого СтрокаТЧ Из СтрокаФормы.ПолучитьЭлементы() Цикл
		СохранитьНастройкуВРегистр(СтрокаТЧ.Настройка,СтрокаТЧ.Значение);
		СохранитьСтрокиРекурсивно(СтрокаТЧ);
	КонецЦикла;	
КонецПроцедуры	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	пкДополнительныеНастройки.Ссылка КАК Настройка,
	|	пкДополнительныеНастройки.ЭтоГруппа КАК ЭтоГруппа,
	|	spДополнительныеНастройкиПрограммы.Значение КАК Значение
	|ИЗ
	|	ПланВидовХарактеристик.пкДополнительныеНастройки КАК пкДополнительныеНастройки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.пкДополнительныеНастройкиPekkaniska КАК spДополнительныеНастройкиПрограммы
	|		ПО (spДополнительныеНастройкиПрограммы.Настройка = пкДополнительныеНастройки.Ссылка)
	|ГДЕ
	|	НЕ пкДополнительныеНастройки.ЭтоГруппа
	|	И пкДополнительныеНастройки.Предопределенный
	|
	|УПОРЯДОЧИТЬ ПО
	|	пкДополнительныеНастройки.Наименование
	|ИТОГИ ПО
	|	Настройка ТОЛЬКО ИЕРАРХИЯ";
	Дерево = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	ДобавитьСтрокиРекурсивно(ДеревоНастроек,Дерево);
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокиРекурсивно (СтрокаФормы,СтрокаДерева)
	Для Каждого СтрокаТЧ Из СтрокаДерева.Строки Цикл
		НоваяСтрока = СтрокаФормы.ПолучитьЭлементы().Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТЧ);
		ДобавитьСтрокиРекурсивно(НоваяСтрока,СтрокаТЧ);
	КонецЦикла;	
КонецПроцедуры	

&НаКлиенте
Процедура ДеревоНастроекЗначениеПриИзменении(Элемент)
	ТекСтрока = Элементы.ДеревоНастроек.ТекущиеДанные;
	СохранитьНастройкуВРегистр(ТекСтрока.Настройка,ТекСтрока.Значение);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СохранитьНастройкуВРегистр(Настройка,Значение)
	Если ЗначениеЗаполнено(Настройка) И Не Настройка.ЭтоГруппа Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	пкДополнительныеНастройкиPekkaniska.Настройка,
		|	пкДополнительныеНастройкиPekkaniska.Значение
		|ИЗ
		|	РегистрСведений.пкДополнительныеНастройкиPekkaniska КАК пкДополнительныеНастройкиPekkaniska
		|ГДЕ
		|	пкДополнительныеНастройкиPekkaniska.Настройка = &Настройка";
		Запрос.УстановитьПараметр("Настройка",Настройка);
		Таблица = Запрос.Выполнить().Выгрузить();
		
		ИскомаяСтрока = Таблица.Найти(Настройка);
		
		Если ЗначениеЗаполнено(Значение) И 
			(ИскомаяСтрока = Неопределено Или ИскомаяСтрока.Значение <> Значение) Тогда
			Менеджер = РегистрыСведений.пкДополнительныеНастройкиPekkaniska.СоздатьМенеджерЗаписи();
			Менеджер.Настройка = Настройка;
			Менеджер.Значение  = Значение;
			Менеджер.Записать(Истина);
		ИначеЕсли Не ЗначениеЗаполнено(Значение) И ИскомаяСтрока <> Неопределено Тогда
			Менеджер = РегистрыСведений.пкДополнительныеНастройкиPekkaniska.СоздатьМенеджерЗаписи();
			Менеджер.Настройка = Настройка;
			Менеджер.Удалить();
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура ОбновитьИдентификаторы(Команда)
	
	ОбновитьИдентификаторыНаСервере();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбновитьИдентификаторыНаСервере()
	
	Справочники.ИдентификаторыОбъектовМетаданных.ВыполнитьОбновлениеДанных(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПросмотретьСписком(Команда)
	//ОткрытьФорму("РегистрСведений.spДополнительныеНастройкиПрограммы.Форма.ФормаПросмотра");
КонецПроцедуры

&НаКлиенте
Процедура ДеревоНастроекЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
      
 КонецПроцедуры

Процедура ВыполнитьПослеВыбораПомещения(ВыбранноеЗначение, НастройкаСтрокой)
    Если ВыбранноеЗначение <> Неопределено Тогда
        Настройка = ПланыВидовХарактеристик.пкДополнительныеНастройкиPekkaniska.НайтиПоНаименованию(НастройкаСтрокой, Истина);
        
        Если ЗначениеЗаполнено(Настройка) Тогда
            МенеджерЗаписи = РегистрыСведений.пкДополнительныеНастройкиPekkaniska.СоздатьМенеджерЗаписи();    
            МенеджерЗаписи.Настройка = Настройка;
            МенеджерЗаписи.Значение  = ВыбранноеЗначение;
            
            МенеджерЗаписи.Записать();
        КонецЕсли;
    КонецЕсли;       
КонецПроцедуры
